[
  {
    "id": 1,
    "title": "Blockchain Token Gated System",
    "description": "This is an app I made as a proof of concept about token gated content as a use case for web3, made with NextJS for the front-end and Metaplex, Anchor and @solana/web3.js for the token gated system implementation. This is done to incentivize users to take part in a platform, or to provide exclusive access to certain content or services. Token gating can be used to create loyalty programs, reward content creators, or to drive user engagement.",
    "tags": ["Web3"],
    "codeLink": "https://github.com/biccsdev/vercelSMBFrames/tree/main",
    "siteLink": "https://smbframes.vercel.app/"
  },
  {
    "id": 2,
    "title": "Twitter Automated Blockchain Mint Bot",
    "description": "This twitter bot was made as a contribution to a web3 community, in order to increase the noise about the collection and make more people aware of this community. It was made using twitter API V2 for interacting with twitter, ExpressJS for the backend and @solana/web3.js library for interacting with the Solana Blockchain. Twitter bots can be a great way to keep your followers up to date on the latest mints of your Digital Collectibles collection. By using a Twitter bot, you can quickly and easily share the new mints with your followers, helping to create excitement and interest in your collection. This can help to increase engagement and sales, as well as give your collection more visibility and recognition. In addition, it can also be a great way to let your followers know when something new and exciting is coming out, giving them a reason to come back and check out your collection.",
    "tags": ["Web3"],
    "codeLink": "https://github.com/biccsdev/villinzBotV2",
    "siteLink": "https://twitter.com/villinzbot"
  },
  {
    "id": 3,
    "title": "URL Shortener API",
    "description": "Made with NestJS and Typescript for the backend and Mongoose for the Database. This System was developed using the Module, Controller, Service, architecture where the Module was needed to allow the Mongoose and UrlShortener modules functionality to be used within the main module. The controller layer was used to intercept the API calls and call the Service layer in order to execute the business logic of the system (shorten the url).",
    "tags": ["Backend"],
    "codeLink": "https://github.com/biccsdev/urlshortener",
    "siteLink": ""
  },
  {
    "id": 4,
    "title": "Chat App API",
    "description": "This chat app was made with NodeJs implementing ExpressJS and Mongoose for the backend, and Html, css and JS vanilla for the Frontend. This app makes use of websocket for bi-directional, full-duplex communication between the client and server. Websockets allow for real-time communication between the two endpoints, allowing for faster and more efficient communication.",
    "tags": ["Backend"],
    "codeLink": "https://github.com/biccsdev/chatApp",
    "siteLink": ""
  },
  {
    "id": 5,
    "title": "Token Gated Solana Wallets Explorer & Mint Site",
    "description": "This system was build using NextJS and Typescript with @Solana/web3.js library to be able to connect to the Blockchain. It allows holders of certain token to access the wallet finder system, where they input a Wallet Address and retrieve those wallet's assets. It also stores a Mint Site for a Solana Collection",
    "tags": ["Web3"],
    "codeLink": "https://github.com/biccsdev/villinzHub",
    "siteLink": "https://villinz-hub.vercel.app/"
  }
]
